[
    {
      "movie_name": "Inception",
      "movie_poster": "https://m.media-amazon.com/images/I/61T3umiIfEL._AC_UF1000,1000_QL80_.jpg",
      "movie_description": "Inception, directed by Christopher Nolan, is a mind-bending science fiction thriller that explores the concept of dreams within dreams. Dom Cobb, played by Leonardo DiCaprio, is a skilled thief who specializes in the art of extraction—stealing secrets from deep within the subconscious during the dream state. When he is offered a chance to have his criminal history erased in exchange for implanting an idea into someone's mind, Cobb assembles a team for an ambitious mission that blurs the lines between reality and imagination.",
      "movie_likes": 150,
      "movie_actors": ["Leonardo DiCaprio", "Joseph Gordon-Levitt", "Ellen Page"]
    },
    {
      "movie_name": "The Shawshank Redemption",
      "movie_poster": "https://m.media-amazon.com/images/I/51R0XUE2OAL._AC_UF1000,1000_QL80_.jpg",
      "movie_description": "The Shawshank Redemption, based on Stephen King's novella, is a poignant tale of hope and friendship set within the confines of Shawshank State Penitentiary. The film follows Andy Dufresne, a banker wrongly convicted of murder, as he forms a bond with fellow inmate Red and navigates the harsh realities of prison life. Through resilience and determination, Andy finds solace in his love for literature and his unwavering belief in the power of redemption, ultimately leading to a remarkable journey of self-discovery and liberation.",
      "movie_likes": 180,
      "movie_actors": ["Tim Robbins", "Morgan Freeman"]
    },
    {
      "movie_name": "The Dark Knight",
      "movie_poster": "https://m.media-amazon.com/images/I/81CLFQwU-WL.jpg",
      "movie_description": "The Dark Knight, directed by Christopher Nolan, is a gripping superhero film that delves into the complexities of justice and morality in the fictional city of Gotham. Batman, portrayed by Christian Bale, faces his greatest challenge yet in the form of the anarchic and enigmatic Joker, played by Heath Ledger. As chaos ensues and allegiances are tested, Batman must confront the darker aspects of his own identity while striving to protect the city he loves. Ledger's iconic performance and Nolan's masterful direction make this a standout entry in the superhero genre.",
      "movie_likes": 220,
      "movie_actors": ["Christian Bale", "Heath Ledger", "Aaron Eckhart"]
    },
    {
      "movie_name": "Pulp Fiction",
      "movie_poster": "https://m.media-amazon.com/images/M/MV5BNGNhMDIzZTUtNTBlZi00MTRlLWFjM2ItYzViMjE3YzI5MjljXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_.jpg",
      "movie_description": "Pulp Fiction, directed by Quentin Tarantino, is a stylish and nonlinear narrative that weaves together interconnected stories of crime, redemption, and existentialism. Set in Los Angeles, the film features an ensemble cast including John Travolta, Uma Thurman, and Samuel L. Jackson in iconic roles. With its unconventional structure and sharp dialogue, Pulp Fiction explores themes of loyalty, violence, and pop culture in a manner that defies traditional storytelling conventions, earning its status as a cult classic and one of Tarantino's most acclaimed works.",
      "movie_likes": 200,
      "movie_actors": ["John Travolta", "Uma Thurman", "Samuel L. Jackson"]
    },
    {
      "movie_name": "Forrest Gump",
      "movie_poster": "https://i.etsystatic.com/15375993/r/il/cbafe5/1303342253/il_fullxfull.1303342253_qphh.jpg",
      "movie_description": "Forrest Gump, directed by Robert Zemeckis, is a heartwarming tale of an unlikely hero who navigates through decades of American history with unwavering innocence and optimism. Forrest Gump, portrayed by Tom Hanks, recounts his extraordinary life journey—from his childhood struggles with leg braces to his adventures in the Vietnam War and encounters with historical figures like Elvis Presley and President Kennedy. Through it all, Forrest's simple wisdom and genuine heart leave a profound impact on those around him, reminding us of the power of kindness and the beauty of life's unexpected moments.",
      "movie_likes": 210,
      "movie_actors": ["Tom Hanks", "Robin Wright", "Gary Sinise"]
    },
    {
      "movie_name": "Fight Club",
      "movie_poster": "https://m.media-amazon.com/images/I/81sZU-iKNGL.jpg",
      "movie_description": "Fight Club, based on Chuck Palahniuk's novel, is a provocative exploration of masculinity, consumerism, and existential despair. Directed by David Fincher, the film follows an insomniac office worker who forms an underground fight club with a charismatic soap salesman. As the club evolves into a nihilistic cult, the protagonist grapples with his own identity and the destructive consequences of his actions. With its dark humor and subversive commentary on modern society, Fight Club continues to captivate audiences with its bold storytelling and unsettling portrayal of disillusionment.",
      "movie_likes": 190,
      "movie_actors": ["Brad Pitt", "Edward Norton", "Helena Bonham Carter"]
    },
    {
      "movie_name": "The Matrix",
      "movie_poster": "https://m.media-amazon.com/images/I/71PfZFFz9yL._AC_UF1000,1000_QL80_.jpg",
      "movie_description": "The Matrix, directed by the Wachowskis, is a groundbreaking science fiction film that revolutionized visual effects and philosophical storytelling. Set in a dystopian future where humanity is enslaved by sentient machines, the film follows Neo, a computer hacker who discovers the truth about reality—that it is an elaborate simulation known as the Matrix. With the help of rebels Morpheus and Trinity, Neo embarks on a journey of self-discovery and rebellion against the oppressive machine overlords. Through its innovative action sequences and thought-provoking themes, The Matrix challenges perceptions of reality and identity.",
      "movie_likes": 230,
      "movie_actors": ["Keanu Reeves", "Laurence Fishburne", "Carrie-Anne Moss"]
    },
    {
      "movie_name": "The Godfather",
      "movie_poster": "https://m.media-amazon.com/images/I/71khjV-MoOS._AC_UF894,1000_QL80_.jpg",
      "movie_description": "The Godfather, directed by Francis Ford Coppola, is a cinematic masterpiece that chronicles the rise and fall of the Corleone crime family. Led by patriarch Vito Corleone, played by Marlon Brando, the family operates as a powerful mafia syndicate in post-war America. As Vito's youngest son, Michael, becomes embroiled in the family business, he must navigate a treacherous world of loyalty, betrayal, and vengeance. With its epic scope, rich character development, and timeless themes of power and legacy, The Godfather remains a landmark achievement in filmmaking.",
      "movie_likes": 250,
      "movie_actors": ["Marlon Brando", "Al Pacino", "James Caan"]
    },
    {
      "movie_name": "Interstellar",
      "movie_poster": "https://i.etsystatic.com/23402008/r/il/b658b2/2327469308/il_570xN.2327469308_492n.jpg",
      "movie_description": "Interstellar, directed by Christopher Nolan, is a visually stunning and emotionally resonant science fiction epic that explores humanity's quest for survival in the face of ecological collapse. Set in a near-future Earth on the brink of extinction, the film follows a group of astronauts who embark on a daring mission through a wormhole in search of a new habitable planet. As they grapple with the mysteries of time and space, they confront the bonds of love and sacrifice that transcend the boundaries of the cosmos. With its awe-inspiring imagery and thought-provoking narrative, Interstellar captivates audiences with its exploration of the human spirit and the vastness of the universe.",
      "movie_likes": 210,
      "movie_actors": ["Matthew McConaughey", "Anne Hathaway", "Jessica Chastain"]
    },
    {
      "movie_name": "The Lord of the Rings: The Return of the King",
      "movie_poster": "https://m.media-amazon.com/images/M/MV5BNzA5ZDNlZWMtM2NhNS00NDJjLTk4NDItYTRmY2EwMWZlMTY3XkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_FMjpg_UX1000_.jpg",
      "movie_description": "The Lord of the Rings: The Return of the King, directed by Peter Jackson, is the epic conclusion to the legendary fantasy trilogy based on J.R.R. Tolkien's novels. As the forces of darkness gather for a final assault on Middle-earth, Frodo and Sam continue their perilous journey to destroy the One Ring and defeat the dark lord Sauron. Meanwhile, Aragorn must rally the free peoples of Middle-earth for a climactic battle against overwhelming odds. With its breathtaking visuals, epic scale, and poignant themes of friendship and heroism, The Return of the King stands as a monumental achievement in cinematic storytelling.",
      "movie_likes": 240,
      "movie_actors": ["Elijah Wood", "Viggo Mortensen", "Ian McKellen"]
    },
    {
      "movie_name": "The Silence of the Lambs",
      "movie_poster": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQIpka354bvRM5SuT2ddckT4kL7T-dW0CJuRsQtADuwGw&s",
      "movie_description": "The Silence of the Lambs, directed by Jonathan Demme, is a chilling psychological thriller that follows FBI trainee Clarice Starling as she seeks the help of incarcerated cannibalistic serial killer Hannibal Lecter to catch another murderer known as Buffalo Bill. As Clarice delves deeper into the twisted minds of these psychopathic criminals, she must confront her own fears and vulnerabilities. With its gripping performances by Jodie Foster and Anthony Hopkins, as well as its taut suspense and psychological depth, The Silence of the Lambs remains a landmark in the thriller genre.",
      "movie_likes": 200,
      "movie_actors": ["Jodie Foster", "Anthony Hopkins", "Scott Glenn"]
    },
    {
      "movie_name": "Gladiator",
      "movie_poster": "https://alternativemovieposters.com/wp-content/uploads/2013/10/gladiatorbg.jpg",
      "movie_description": "Gladiator, directed by Ridley Scott, is an epic historical drama that transports viewers to ancient Rome and follows the journey of Maximus Decimus Meridius, a general turned gladiator seeking vengeance against the corrupt emperor who murdered his family and betrayed him. As Maximus rises through the ranks of the gladiatorial arena, he becomes a symbol of resistance against tyranny and oppression, inspiring the people to rise up against their oppressors. With its breathtaking action sequences, emotional depth, and powerhouse performances, Gladiator captive",
      "movie_likes": 220,
      "movie_actors": ["Russell Crowe", "Joaquin Phoenix", "Connie Nielsen"]
    }
  ]
  